ngoquytuan/stm32c8/stm32c8t6v2/USER/w5500/W5500TQ.c
/**********************************************************************************
W5500 Network module main code

**********************************************************************************/

#include "stm32f10x.h"
#include "spi.h"				
#include "W5500.h"
#include "delay.h"	


//Network parameter variable definition 
u8 Gateway_IP[4];//Gateway IP address 
u8 Sub_Mask[4];	//Subnet mask 
u8 Phy_Addr[6];	//Physical address (MAC) 
u8 IP_Addr[4];	//Local IP address 

u8 S0_Port[2];	//Port number of port 0(5000) 
u8 S0_DIP[4];	//Port 0 destination IP address 
u8 S0_DPort[2];	//Port 0 destination port number(6000) 

u8 UDP_DIPR[4];	    //UDP(Broadcast mode, destination host IP address
u8 UDP_DPORT[2];	//UDP(Broadcast) mode, destination host port number


//Port operating mode
u8 S0_Mode =3;	            //Port 0 operating mode, 0: TCP server mode, 1: TCP client mode, 2: UDP (broadcast) mode
#define TCP_SERVER	0x00	//TCP Server mode
#define TCP_CLIENT	0x01	//TCP Client mode
#define UDP_MODE	0x02	//UDP (broadcast) mode 

//Port running status
u8 S0_State =0;	            //Port 0 status record, 1: port complete initialization, 2 ports complete connection (can transfer data normally)
#define S_INIT		0x01	//Port completion initialization 
#define S_CONN		0x02	//Port complete connection,Can transfer data normally 

//Status of the port to send and receive data
u8 S0_Data;	               	//Port 0 receives and sends data status, 1: port receives data, 2: port sends data completed
#define S_RECEIVE	 0x01	//The port received a packet 
#define S_TRANSMITOK 0x02	//The port sends a packet to complete

//Port data buffer 
u8 Rx_Buffer[2048];	//Port receive data buffer 
u8 Tx_Buffer[2048];	//Port send data buffer 

u8 W5500_Interrupt;	//W5500 interrupt flag (0: no interrupt, 1: interrupt)







//W5500 Port initialization and configuration interrupt mode
//The corresponding configuration instructions:
//sck PA5  miso PA6  mosi PA7  rst PA2  int PA3  cs PA0
void W5500_GPIO_Init(void)
{
	GPIO_InitTypeDef  GPIO_InitStructure;	

 	EXTI_InitTypeDef EXTI_InitStructure;			//Interrupt configuration, which interrupt line  EXTI_Line0-15
													//mode EXTI_Mode_Interrupt Interrupt EXTI_Mode_Event event
													//Trigger mode  EXTI_Trigger_Falling Falling edge trigger
													//			EXTI_Trigger_Rising	 Rising edge trigger
													//			EXTI_Trigger_Rising_Falling	  Arbitrary level trigger

 	NVIC_InitTypeDef NVIC_InitStructure;			//Interrupt parameter interrupt priority


  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);	//Enable the alternate function clock



	RCC_APB2PeriphClockCmd(	RCC_APB2Periph_GPIOA, ENABLE );//PORTA Clock enable


	// W5500_RST Pin initialization configuration (PA2) 
	GPIO_InitStructure.GPIO_Pin  = W5500_RST;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(W5500_RST_GPIO, &GPIO_InitStructure);
	GPIO_ResetBits(W5500_RST_GPIO, W5500_RST);
	
	// W5500_INT Pin initialization configuration(PA3) 	
	GPIO_InitStructure.GPIO_Pin = W5500_INT;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(W5500_INT_GPIO, &GPIO_InitStructure);


	// Initialize the network module SPI-CS pin (PA0)
	GPIO_InitStructure.GPIO_Pin = W5500_SCS;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_Init(W5500_SCS_GPIO, &GPIO_InitStructure);
	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);



 	// Enable the EXTI3 Interrupt 
	NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;				//W5500_INT External interrupt channel
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x02;	//Preemption priority 2 
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x02;			//Subpriority 2
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;					//Enable external interrupt channel
	NVIC_Init(&NVIC_InitStructure);


  	// Connect EXTI Line3 to PA3 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource3);


	// PA3 as W5500 interrupt input 
	EXTI_InitStructure.EXTI_Line = EXTI_Line3;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

}


//Interrupt line 3 PA3 responds to data from W5500 and concatenates a flag.
void EXTI3_IRQHandler(void)
{
	if(EXTI_GetITStatus(EXTI_Line3) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line3);	//Clear interrupt line
		W5500_Interrupt=1;
	}
}



//Send a byte via SPI1
//dat Byte sent
//No return
void SPI1_Send_Byte(u8 dat)
{
	SPI_I2S_SendData(SPI1,dat);//Write 1 byte of data
	while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);//Infinite loop waiting for data register empty
}



//PI1 Send 2 bytes of data (16 bits)
//dat:16-bit data to be sent
void SPI1_Send_Short(u16 dat)
{
	SPI1_Send_Byte(dat/256);//Write data high dat>>8
	SPI1_Send_Byte(dat);	//Write data low
}




//Write 1 byte data to the W5500 specified address register via SPI1
// reg:16 Bit register address, dat:Data to be written
void Write_W5500_1Byte(u16 reg, u8 dat)
{
	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//CS chip selection W5500

	SPI1_Send_Short(reg);   //Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM1|RWB_WRITE|COMMON_R); //Write control byte via SPI1,1 byte data length,Write data,Select general purpose register
	SPI1_Send_Byte(dat);  //Write 1 byte of data

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection
}




//Write 2 bytes of data to the specified address register via SPI1
//Reg: 16-bit register address, dat: 16-bit data to be written (2 bytes)
void Write_W5500_2Byte(u16 reg, u16 dat)
{
	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//CS chip selection W5500
		
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM2|RWB_WRITE|COMMON_R);//Write control byte via SPI1,2 bytes of data length,Write data,Select general purpose register
	SPI1_Send_Short(dat);//Write 16-bit data

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection
}




//Write n bytes of data to the specified address register via SPI1
//Reg: 16-bit register address, *dat_ptr: pointer to be written to the data buffer, size: length of data to be written
void Write_W5500_nByte(u16 reg, u8 *dat_ptr, u16 size)
{
	u16 i;

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//CS chip selection W5500	
		
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(VDM|RWB_WRITE|COMMON_R);//Write control byte through SPI1, N bytes of data length, write data, select general purpose register

	for(i=0;i<size;i++)//The loop writes the size bytes of the buffer to the W5500.
	{
		SPI1_Send_Byte(*dat_ptr++);//Write a byte of data
	}

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection
}




//Write 1 byte of data to the specified port register via SPI1
//s: port number, reg: 16-bit register address, dat: data to be written
void Write_W5500_SOCK_1Byte(SOCKET s, u16 reg, u8 dat)
{
	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//CS chip selection W5500	
		
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM1|RWB_WRITE|(s*0x20+0x08));//Write control byte through SPI1, 1 byte data length, write data, select port s register
	SPI1_Send_Byte(dat);//Write 1 byte of data

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection
}



//Write 2 bytes of data to the specified port register via SPI1
//s: port number, reg: 16-bit register address, dat: 16-bit data to be written (2 bytes)
void Write_W5500_SOCK_2Byte(SOCKET s, u16 reg, u16 dat)
{
	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//CS chip selection W5500
			
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM2|RWB_WRITE|(s*0x20+0x08));//Write control byte via SPI1,2Byte data length,Write data,Select port s register
	SPI1_Send_Short(dat);//Write 16-bit data

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection
}




