ngoquytuan/stm32c8/stm32c8t6v2/USER/w5500/W5500TQ.c
//通过SPI1向指定端口寄存器写4个字节数据
//s:端口号,reg:16位寄存器地址,*dat_ptr:待写入的4个字节缓冲区指针
void Write_W5500_SOCK_4Byte(SOCKET s, u16 reg, u8 *dat_ptr)
{
	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500
			
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM4|RWB_WRITE|(s*0x20+0x08));//Write control byte via SPI1,4Byte data length,Write data,Select port s register

	SPI1_Send_Byte(*dat_ptr++);//写第1个字节数据
	SPI1_Send_Byte(*dat_ptr++);//写第2个字节数据
	SPI1_Send_Byte(*dat_ptr++);//写第3个字节数据
	SPI1_Send_Byte(*dat_ptr++);//写第4个字节数据

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);//Pull high CS to cancel the chip selection
}



//读取W5500指定地址寄存器的1个字节数据
//reg:16位寄存器地址
//返回:读取到寄存器的1个字节数据
u8 Read_W5500_1Byte(u16 reg)
{
	u8 i;

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500
			
	SPI1_Send_Short(reg);  //Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM1|RWB_READ|COMMON_R);//Write control byte via SPI1,1Byte data length,Reading data,选择通用寄存器

	i=SPI_I2S_ReceiveData(SPI1);
	SPI1_Send_Byte(0x00);//发送空数据 等待返回数据
	i=SPI_I2S_ReceiveData(SPI1);//读取1个字节数据

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);//Pull high CS to cancel the chip selection
	return i;//返回读取到的寄存器数据
}



//读W5500指定端口寄存器的1个字节数据
//s:端口号,reg:16位寄存器地址
//返回值:读取到寄存器的1个字节数据
u8 Read_W5500_SOCK_1Byte(SOCKET s, u16 reg)
{
	u8 i;

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500
			
	SPI1_Send_Short(reg);   //Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM1|RWB_READ|(s*0x20+0x08));//Write control byte via SPI1,1Byte data length,Reading data,Select port s register

	i=SPI_I2S_ReceiveData(SPI1);
	SPI1_Send_Byte(0x00);   //发送空数据 等待返回数据
	i=SPI_I2S_ReceiveData(SPI1);//读取1个字节数据

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);  //Pull high CS to cancel the chip selection
	return i;//返回读取到的寄存器数据
}



//读W5500指定端口寄存器的2个字节数据
//s:端口号,reg:16位寄存器地址
//返回值:读取到寄存器的2个字节数据(16位)
u16 Read_W5500_SOCK_2Byte(SOCKET s, u16 reg)
{
	u16 i;

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500
			
	SPI1_Send_Short(reg);//Write 16-bit register address via SPI1
	SPI1_Send_Byte(FDM2|RWB_READ|(s*0x20+0x08));//Write control byte via SPI1,2Byte data length,Reading data,Select port s register

	i=SPI_I2S_ReceiveData(SPI1);
	SPI1_Send_Byte(0x00);//发送空数据 等待返回数据
	i=SPI_I2S_ReceiveData(SPI1);//读取高位数据
	SPI1_Send_Byte(0x00);//发送空数据 等待返回数据
	i*=256;
	i+=SPI_I2S_ReceiveData(SPI1);//读取低位数据

	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);//Pull high CS to cancel the chip selection
	return i;//返回读取到的寄存器数据
}




//从W5500接收数据缓冲区中读取数据
//s:端口号,*dat_ptr:数据保存缓冲区指针
//返回值:读取到的数据长度,rx_size个字节
u16 Read_SOCK_Data_Buffer(SOCKET s, u8 *dat_ptr)
{
	u16 rx_size;
	u16 offset, offset1;
	u16 i;
	u8 j;

	rx_size=Read_W5500_SOCK_2Byte(s,Sn_RX_RSR);
	if(rx_size==0) return 0;  //没接收到数据则返回
	if(rx_size>1460) rx_size=1460;

	offset=Read_W5500_SOCK_2Byte(s,Sn_RX_RD);
	offset1=offset;
	offset&=(S_RX_SIZE-1);    //计算实际的物理地址

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500

	SPI1_Send_Short(offset);//写16位地址
	SPI1_Send_Byte(VDM|RWB_READ|(s*0x20+0x18));//写控制字节,NByte data length,Reading data,Select port s register
	j=SPI_I2S_ReceiveData(SPI1);
	
	if((offset+rx_size)<S_RX_SIZE)//如果最大地址未超过W5500接收缓冲区寄存器的最大地址
	{
		for(i=0;i<rx_size;i++)//循环读取rx_size个字节数据
		{
			SPI1_Send_Byte(0x00);//发送一个哑数据
			j=SPI_I2S_ReceiveData(SPI1);//读取1个字节数据
			*dat_ptr=j;//将读取到的数据保存到数据保存缓冲区
			dat_ptr++;//数据保存缓冲区指针地址自增1
		}
	}
	else//如果最大地址超过W5500接收缓冲区寄存器的最大地址
	{
		offset=S_RX_SIZE-offset;
		for(i=0;i<offset;i++)//循环读取出前offset个字节数据
		{
			SPI1_Send_Byte(0x00);//发送一个哑数据
			j=SPI_I2S_ReceiveData(SPI1);//读取1个字节数据
			*dat_ptr=j;//将读取到的数据保存到数据保存缓冲区
			dat_ptr++;//数据保存缓冲区指针地址自增1
		}
		GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS);  //Pull high CS to cancel the chip selection

		GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//拉低CS CS chip selection W5500

		SPI1_Send_Short(0x00);//写16位地址
		SPI1_Send_Byte(VDM|RWB_READ|(s*0x20+0x18));//写控制字节,NByte data length,Reading data,Select port s register
		j=SPI_I2S_ReceiveData(SPI1);

		for(;i<rx_size;i++)//循环读取后rx_size-offset个字节数据
		{
			SPI1_Send_Byte(0x00);//发送一个哑数据
			j=SPI_I2S_ReceiveData(SPI1);//读取1个字节数据
			*dat_ptr=j;//将读取到的数据保存到数据保存缓冲区
			dat_ptr++;//数据保存缓冲区指针地址自增1
		}
	}
	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //Pull high CS to cancel the chip selection

	offset1+=rx_size;//更新实际物理地址,即下次读取接收到的数据的起始地址
	Write_W5500_SOCK_2Byte(s, Sn_RX_RD, offset1);
	Write_W5500_SOCK_1Byte(s, Sn_CR, RECV);//发送启动接收命令
	return rx_size;//Returns the length of the received data
}



//将数据写入W5500的数据发送缓冲区
//s:端口号,*dat_ptr:数据保存缓冲区指针,size:待写入数据的长度
void Write_SOCK_Data_Buffer(SOCKET s, u8 *dat_ptr, u16 size)
{
	u16 offset,offset1;
	u16 i;

	//If it is UDP mode, you can set the IP and port number of the destination host here.
	if((Read_W5500_SOCK_1Byte(s,Sn_MR)&0x0f) == MR_UDP)//如果是UDP模式将接收到的主机地址和端口更新到模块端口中
	{													
		Write_W5500_SOCK_4Byte(s, Sn_DIPR, UDP_DIPR);//设置目的主机IP  		
		Write_W5500_SOCK_2Byte(s, Sn_DPORTR, UDP_DPORT[0]*256+UDP_DPORT[1]);//设置目的主机端口号				
	}

	offset=Read_W5500_SOCK_2Byte(s,Sn_TX_WR);
	offset1=offset;
	offset&=(S_TX_SIZE-1);//Calculate the actual physical address

	GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//Chip selection

	SPI1_Send_Short(offset);//写16位地址
	SPI1_Send_Byte(VDM|RWB_WRITE|(s*0x20+0x10));//写控制字节,NByte data length,Write data,Select port s register

	if((offset+size)<S_TX_SIZE)//如果最大地址未超过W5500发送缓冲区寄存器的最大地址
	{
		for(i=0;i<size;i++)//循环写入size个字节数据
		{
			SPI1_Send_Byte(*dat_ptr++);//写入一个字节的数据		
		}
	}
	else//如果最大地址超过W5500发送缓冲区寄存器的最大地址
	{
		offset=S_TX_SIZE-offset;
		for(i=0;i<offset;i++)//循环写入前offset个字节数据
		{
			SPI1_Send_Byte(*dat_ptr++);//写入一个字节的数据
		}
		GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //置W5500的SCS为高电平

		GPIO_ResetBits(W5500_SCS_GPIO, W5500_SCS);//置W5500的SCS为低电平

		SPI1_Send_Short(0x00);//写16位地址
		SPI1_Send_Byte(VDM|RWB_WRITE|(s*0x20+0x10));//写控制字节,NByte data length,Write data,Select port s register

		for(;i<size;i++)//循环写入size-offset个字节数据
		{
			SPI1_Send_Byte(*dat_ptr++);//write one byte of data
		}
	}
	GPIO_SetBits(W5500_SCS_GPIO, W5500_SCS); //置W5500的SCS为高电平

	offset1+=size;//Update the actual physical address, that is, the starting address of the next time the data to be sent is sent to the transmit data buffer.
	Write_W5500_SOCK_2Byte(s, Sn_TX_WR, offset1);
	Write_W5500_SOCK_1Byte(s, Sn_CR, SEND);//Send start send command				
}



//W5500 Hardware reset
//Note: The reset pin of W5500 keeps low level for at least 500us to make W5500 enter reset state.
void W5500_Hardware_Reset(void)
{
	GPIO_ResetBits(W5500_RST_GPIO, W5500_RST);  //Reset pin pulled low
	delay_ms(50);
	GPIO_SetBits(W5500_RST_GPIO, W5500_RST);    //Reset pin pull high
	delay_ms(200);
	while((Read_W5500_1Byte(PHYCFGR)&LINK)==0); //Infinite loop waiting for Ethernet connection to complete
//Here you have to connect the network cable to the route and module, otherwise you will not be able to pass
}




