ngoquytuan/stm32c8/stm32c8t6v2/USER/w5500/W5500TQ.c
//Initialize the corresponding register of W5500
//Description: After the hardware is initialized, it must be initialized accordingly.
void W5500_Init(void)
{
	u8 i=0;

	Write_W5500_1Byte(MR, RST);  //Software reset W5500, set to 1, automatically cleared after reset
	delay_ms(10);                //Delay 10ms

	//Set the IP address of the gateway (Gateway) to 4 bytes.
	//Using a gateway allows communication to break through the limitations of subnets, 
	//allowing access to other subnets or access through the gateway Internet
	Write_W5500_nByte(GAR, Gateway_IP, 4);
			
	//Set the subnet mask (MASK) value, SUB_MASK is 4 bytes
	//Subnet mask for subnet operations
	Write_W5500_nByte(SUBR,Sub_Mask,4);		
	
	//Set physical address,PHY_ADDR 6 bytes,Used to uniquely identify the physical address value of a network device
	//The address value needs to be applied to the IEEE，According to the OUI regulations, the first 3 bytes are the vendor code, and the last three bytes are the product serial number.
	//If you define your own physical address, note that the first byte must be even
	Write_W5500_nByte(SHAR,Phy_Addr,6);		

	//Set the IP address of this machine,IP_ADDR is 4 bytes
	//Note that the gateway IP must belong to the same subnet as the local IP, otherwise the local machine will not be able to find the gateway.
	Write_W5500_nByte(SIPR,IP_Addr,4);		
	
	//Set the size of the send buffer and receive buffer，Refer to the W5500 data sheet. Initialization is configured to 2k for a total of 16k.
	for(i=0;i<8;i++)
	{
		Write_W5500_SOCK_1Byte(i,Sn_RXBUF_SIZE, 0x02);//Socket Rx memory size=2k
		Write_W5500_SOCK_1Byte(i,Sn_TXBUF_SIZE, 0x02);//Socket Tx mempry size=2k
	}

	//Set the retry time, the default is 2000(200ms) 
	//The value of each unit is 100 microseconds, and the value at initialization is set to 2000 (0x07D0), equal to 200 milliseconds.
	Write_W5500_2Byte(RTR, 0x07d0);

	//Set the number of retries, the default is 8 times 
	//If the number of retransmissions exceeds the set value, a timeout interrupt is generated (the Sn_IR timeout bit (TIMEOUT) in the associated port interrupt register is set to "1")
	Write_W5500_1Byte(RCR,8);

	//Start the interrupt, refer to the W5500 data sheet to determine the type of interrupt you need.
	//IMR_CONFLICT is an abnormal interruption of IP address conflict, IMR_UNREACH is an abnormal interruption of address unreachable when UDP communication
	//Others are Socket event interrupts, add as needed
	Write_W5500_1Byte(IMR,IM_IR7 | IM_IR6);	//Interrupt enable register
	Write_W5500_1Byte(SIMR,S0_IMR);			//socket Interrupt Status 0-7 Registers are configured on S0
	Write_W5500_SOCK_1Byte(0, Sn_IMR, IMR_SENDOK | IMR_TIMEOUT | IMR_RECV | IMR_DISCON | IMR_CON);	//S0 Interrupt function is all open
}




//Check the gateway server
//It belongs to the corresponding operation of the analog one port, and judges whether the W5500 mode enters the communicable state.
//Return value: TRUE (0xFF) is returned successfully, FALSE (0x00) is returned.
u8 Detect_Gateway(void)
{
	u8 ip_adde[4];
	ip_adde[0]=IP_Addr[0]+1;
	ip_adde[1]=IP_Addr[1]+1;
	ip_adde[2]=IP_Addr[2]+1;
	ip_adde[3]=IP_Addr[3]+1;

	//Check the gateway and get the physical address of the gateway
	Write_W5500_SOCK_4Byte(0,Sn_DIPR,ip_adde);//Write a different IP value to the destination address register than the local IP address
	Write_W5500_SOCK_1Byte(0,Sn_MR,MR_TCP);   //Set the socket to TCP mode.
	Write_W5500_SOCK_1Byte(0,Sn_CR,OPEN);     //Open Socket	
	delay_ms(5);//Delay 5ms 	
	
	if(Read_W5500_SOCK_1Byte(0,Sn_SR) != SOCK_INIT)//If the socket fails to open, the TCP mode fails to start.
	{
		Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);//Open unsuccessful, close Socket
		return FALSE;//Return FALSE(0x00)
	}

	Write_W5500_SOCK_1Byte(0,Sn_CR,CONNECT);//Set Socket to Connect mode TCP as client					

	do
	{
		u8 j=0;
		j=Read_W5500_SOCK_1Byte(0,Sn_IR);//Read Socket0 interrupt flag register
		if(j!=0)						 //If there is an interrupt prompt, write 1 clear corresponding interrupt
		Write_W5500_SOCK_1Byte(0,Sn_IR,j);
		delay_ms(5);
		if((j&IR_TIMEOUT) == IR_TIMEOUT) //time out
		{
			return FALSE;	
		}
		else if(Read_W5500_SOCK_1Byte(0,Sn_DHAR) != 0xff)	 //Only judge whether the last MAC is FF. If it is successfully loaded, it should not be FF.
		{
			Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);//Close Socket Description Test successful
			return TRUE;							
		}
	}while(1);
}




//Specify Socket (0~7) initialization
//s:Port to be initialized
void Socket_Init(SOCKET s)
{
	//Set the fragment length, refer to the W5500 data sheet, the value can be modified.	
	Write_W5500_SOCK_2Byte(0, Sn_MSSR, 1460);//Maximum number of fragmented bytes =1460(0x5b4)
	//Set the specified port
	switch(s)
	{
		case 0:
			//Set the port number of port 0
			Write_W5500_SOCK_2Byte(0, Sn_PORT, S0_Port[0]*256+S0_Port[1]);
			//Set port 0 destination (remote) port number
			Write_W5500_SOCK_2Byte(0, Sn_DPORTR, S0_DPort[0]*256+S0_DPort[1]);
			//Set port 0 destination (remote) IP address
			Write_W5500_SOCK_4Byte(0, Sn_DIPR, S0_DIP);			
			
			break;

		case 1:
			break;

		case 2:
			break;

		case 3:
			break;

		case 4:
			break;

		case 5:
			break;

		case 6:
			break;

		case 7:
			break;

		default:
			break;
	}
}



//设置指定Socket(0~7)为客户端与远程服务器连接
//s:待设定的端口
//返回值:成功返回TRUE(0xFF),失败返回FALSE(0x00)
//说明  :当本机Socket工作在客户端模式时,引用该程序,与远程服务器建立连接
//	     如果启动连接后出现超时中断，则与服务器连接失败,需要重新调用该程序连接
//	     该程序每调用一次,就与服务器产生一次连接
u8 Socket_Connect(SOCKET s)
{
	Write_W5500_SOCK_1Byte(s,Sn_MR,MR_TCP);//设置socket为TCP模式
	Write_W5500_SOCK_1Byte(s,Sn_CR,OPEN);//打开Socket
	delay_ms(5);//延时5ms
	if(Read_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_INIT)//如果socket打开失败
	{
		Write_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);//打开不成功,关闭Socket
		return FALSE;//返回FALSE(0x00)
	}
	Write_W5500_SOCK_1Byte(s,Sn_CR,CONNECT);//设置Socket为Connect模式
	return TRUE;//返回TRUE,设置成功
}




//设置指定Socket(0~7)作为服务器等待远程主机的连接
//s:待设定的端口
//返回值:成功返回TRUE(0xFF),失败返回FALSE(0x00)
//说明  :当本机Socket工作在服务器模式时,引用该程序,等等远程主机的连接
//		 该程序只调用一次,就使W5500设置为服务器模式
u8 Socket_Listen(SOCKET s)
{
	Write_W5500_SOCK_1Byte(s,Sn_MR,MR_TCP);//设置socket为TCP模式 
	Write_W5500_SOCK_1Byte(s,Sn_CR,OPEN);//打开Socket	
	delay_ms(5);//延时5ms
	if(Read_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_INIT)//如果socket打开失败
	{
		Write_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);//打开不成功,关闭Socket
		return FALSE;//返回FALSE(0x00)
	}	
	Write_W5500_SOCK_1Byte(s,Sn_CR,LISTEN);//设置Socket为侦听模式	
	delay_ms(5);//延时5ms
	if(Read_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_LISTEN)//如果socket设置失败
	{
		Write_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);//设置不成功,关闭Socket
		return FALSE;//返回FALSE(0x00)
	}

