ngoquytuan/stm32c8/stm32c8t6v2/USER/w5500/W5500TQ.c
	return TRUE;

	//至此完成了Socket的打开和设置侦听工作,至于远程客户端是否与它建立连接,则需要等待Socket中断，
	//以判断Socket的连接是否成功。参考W5500数据手册的Socket中断状态
	//在服务器侦听模式不需要设置目的IP和目的端口号
}





//设置指定Socket(0~7)为UDP模式
//s:待设定的端口
//返回值:成功返回TRUE(0xFF),失败返回FALSE(0x00)
//说明  :如果Socket工作在UDP模式,引用该程序,在UDP模式下,Socket通信不需要建立连接
//		 该程序只调用一次，就使W5500设置为UDP模式
u8 Socket_UDP(SOCKET s)
{
	Write_W5500_SOCK_1Byte(s,Sn_MR,MR_UDP);//设置Socket为UDP模式*/
	Write_W5500_SOCK_1Byte(s,Sn_CR,OPEN);//打开Socket*/
	delay_ms(5);//延时5ms
	if(Read_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_UDP)//如果Socket打开失败
	{
		Write_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);//打开不成功,关闭Socket
		return FALSE;//返回FALSE(0x00)
	}
	else
		return TRUE;

	//至此完成了Socket的打开和UDP模式设置,在这种模式下它不需要与远程主机建立连接
	//因为Socket不需要建立连接,所以在发送数据前都可以设置目的主机IP和目的Socket的端口号
	//如果目的主机IP和目的Socket的端口号是固定的,在运行过程中没有改变,那么也可以在这里设置
}





/**
  * @brief  W5500_Interrupt_Process
  * @param  Xu ly ngat W5500
  * @retval  
  */
void W5500_Interrupt_Process(void)
{
	u8 i,j;

Here:
	W5500_Interrupt=0;//Clear interrupt flag
	i = Read_W5500_1Byte(IR);//Read interrupt flag register
	Write_W5500_1Byte(IR, (i&0xf0));//Write back clear interrupt flag

//	if((i & CONFLICT) == CONFLICT)//IP Address conflict exception handling
//	{
//		 //Add code yourself
//	}
//
//	if((i & UNREACH) == UNREACH)//UDP Address cannot reach exception handling in mode
//	{
//		//Add code yourself
//	}

	i=Read_W5500_1Byte(SIR);//Read port interrupt flag register	
	if((i & S0_INT) == S0_INT)//Socket0 Event processing
	{
		j=Read_W5500_SOCK_1Byte(0,Sn_IR); //Read Socket0 interrupt flag register
		Write_W5500_SOCK_1Byte(0,Sn_IR,j);//Write back clear interrupt flag

		if(j&IR_CON)//In TCP mode, Socket0 is successfully connected. 
		{
			S0_State|=S_CONN;//Network connection status 0x02, the port is connected, and the data can be transmitted normally.
		}
		if(j&IR_DISCON)//Socket disconnection processing in TCP mode
		{
			Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);//Close the port and wait for the connection to be reopened
			Socket_Init(0);		//Specify Socket (0~7) initialization, initialize port 0
			S0_State=0;//Network connection status 0x00, port connection failed
		}
		if(j&IR_SEND_OK)//Socket0 data transmission is completed, you can start the S_tx_process() function to send data again. 
		{
			S0_Data|=S_TRANSMITOK;//The port sends a packet to complete 
		}
		if(j&IR_RECV)//Socket receives the data, you can start the S_rx_process () function 
		{
			S0_Data|=S_RECEIVE;//The port received a packet
		}
		if(j&IR_TIMEOUT)//Socket connection or data transfer timeout processing 
		{
			Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);// Close the port and wait for the connection to be reopened
			S0_State=0;//Network connection status 0x00, port connection failed
		}
	}

	if(Read_W5500_1Byte(SIR) != 0) 
		goto Here;
}

